# int(정수)형

a = 5
b = -5
c = 0

print(type(a), type(b), type(c))

# float(실수)형

d = 5.5
e = -5.5
f = 0.0

print(type(d), type(e), type(f))

# 과학적 표기법

g = 1.234567e5

print(g)

# 문자열

text = "String 'Data' Type"

print(text)

# 탈출문자
# \', \", \\, \n, \r, \t
# \' = '(작은 따옴표) 출력 
# \" = "(쌍 따옴표) 출력 
# \\ = \(역 슬래시) 출력 
# \n = 한줄 띄고 출력
# \r = 커서를 행에 가장 앞에 옮김
# \t = 커서를 8번뒤로 옮긴뒤 출력

# """(String)""" , '''(String)''' 따옴표 안에 있으면 개행을 하고 따옴표를 제약 없이 사용 가능

# 문자열 연산
# 변수(text) 끼리 더해서(+) 한 줄에 출력 할 수도 있고 정수(int) 와 곱셈(*) 을 통해서 몇번 반복할지도 지정 가능
# sep : 문자 공백 구문
# end : 문자 마지막 구문

# 내장함수 : 뒤에 괄호가 붙는 어떠한 기능을 가진 코드
# 메서드 : 앞에 .(참조연산자) 이 붙는 함수

# bool형 : 논리연산을 이용해서 여러개의 명제를 하나로 조합하거나 명제를 부정 (True , False)
#